particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
os_thread_return_t BleObject::BleEventDispatcher::processBleEventFromThread(void* param) {
    BleEventDispatcher* dispatcher = static_cast<BleEventDispatcher*>(param);
    while (1) {
        ble_evt_t* event;
        if (!os_queue_take(dispatcher->evtQueue_, &event, CONCURRENT_WAIT_FOREVER, nullptr)) {
            SCOPE_GUARD ({
                dispatcher->freeEventData(event);
            });
            switch (event->header.evt_id) {
                case BLE_GAP_EVT_ADV_SET_TERMINATED: {
                    BleObject::getInstance().broadcaster()->processAdvStoppedEventFromThread(event);
                    break;
                }
                case BLE_GAP_EVT_ADV_REPORT: {
                    BleObject::getInstance().observer()->processAdvReportEventFromThread(event);
                    break;
                }
                case BLE_GAP_EVT_CONNECTED: {
                    BleObject::getInstance().connMgr()->processConnectedEventFromThread(event);
                    break;
                }
                case BLE_GAP_EVT_DISCONNECTED: {
                    BleObject::getInstance().connMgr()->processDisconnectedEventFromThread(event);
                    break;
                }
                case BLE_GAP_EVT_CONN_PARAM_UPDATE: {
                    BleObject::getInstance().connMgr()->processConnParamsUpdatedEventFromThread(event);
                    break;
                }
                case BLE_GATTC_EVT_EXCHANGE_MTU_RSP:
                case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST: {
                    BleObject::getInstance().connMgr()->processAttMtuExchangeEventFromThread(event);
                    break;
                }
                case BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP: {
                    BleObject::getInstance().gattc()->processSvcDiscEventFromThread(event);
                    break;
                }
                case BLE_GATTC_EVT_CHAR_DISC_RSP: {
                    BleObject::getInstance().gattc()->processCharDiscEventFromThread(event);
                    break;
                }
                case BLE_GATTC_EVT_DESC_DISC_RSP: {
                    BleObject::getInstance().gattc()->processDescDiscEventFromThread(event);
                    break;
                }
                case BLE_GATTC_EVT_READ_RSP: {
                    BleObject::getInstance().gattc()->processDataReadEventFromThread(event);
                    break;
                }
                case BLE_GATTS_EVT_WRITE: {
                    BleObject::getInstance().gatts()->processDataWrittenEventFromThread(event);
                    break;
                }
                case BLE_GATTC_EVT_HVX: {
                    BleObject::getInstance().gattc()->processDataNotifiedEventFromThread(event);
                }
                default: {
                    break;
                }
            }
        } else {
            LOG(ERROR, "BLE event thread exited.");
            break;
        }
    }
    os_thread_exit(dispatcher->evtThread_);
}

struct BleGapImpl {
    BleObject::BleGap* instance;
};
static BleGapImpl bleGapImpl;

int BleObject::BleGap::init() {
    // Set the default device name
    char devName[BLE_MAX_DEV_NAME_LEN] = {};
    CHECK(get_device_name(devName, sizeof(devName)));
    CHECK(setDeviceName(devName, strlen(devName)));
    bleGapImpl.instance = this;
    NRF_SDH_BLE_OBSERVER(bleGap, 1, processBleGapEvents, &bleGapImpl);
    gapInitialized_ = true;
    return SYSTEM_ERROR_NONE;
}

int BleObject::BleGap::setDeviceName(const char* deviceName, size_t len) const {
    char name[BLE_MAX_DEV_NAME_LEN] = {};
    if (deviceName == nullptr || len == 0) {
        CHECK(get_device_name(name, sizeof(name)));
        len = strlen(name);
    } else {
        len = std::min(len, sizeof(name));
        memcpy(name, deviceName, len);
    }
    ble_gap_conn_sec_mode_t secMode;
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&secMode);
    int ret = sd_ble_gap_device_name_set(&secMode, (const uint8_t*)name, len);
    return nrf_system_error(ret);
}

int BleObject::BleGap::getDeviceName(char* deviceName, size_t len) const {
    CHECK_TRUE(deviceName, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(len, SYSTEM_ERROR_INVALID_ARGUMENT);
    uint16_t nameLen = len - 1; // Reserve 1 byte for the NULL-terminated character.
    int ret = sd_ble_gap_device_name_get((uint8_t*)deviceName, &nameLen);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    nameLen = std::min(len - 1, (size_t)nameLen);
    deviceName[nameLen] = '\0';
    return SYSTEM_ERROR_NONE;
}

int BleObject::BleGap::setDeviceAddress(const hal_ble_addr_t* address) const {
    // The identity address cannot be changed while advertising, scanning or creating a connection.
    CHECK_FALSE(BleObject::getInstance().broadcaster()->advertising(), SYSTEM_ERROR_INVALID_STATE);
    CHECK_FALSE(BleObject::getInstance().observer()->scanning(), SYSTEM_ERROR_INVALID_STATE);
    CHECK_FALSE(BleObject::getInstance().connMgr()->connecting(address), SYSTEM_ERROR_INVALID_STATE);
    hal_ble_addr_t newAddr = {};
    if (address == nullptr) {
        newAddr = chipDefaultAddress();
    } else {
        newAddr = *address;
    }
    if (newAddr.addr_type != BLE_SIG_ADDR_TYPE_PUBLIC && newAddr.addr_type != BLE_SIG_ADDR_TYPE_RANDOM_STATIC) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (newAddr.addr_type == BLE_SIG_ADDR_TYPE_RANDOM_STATIC && (newAddr.addr[5] & 0xC0) != 0xC0) {
        // For random static address, the two most significant bits of the address shall be equal to 1.
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    ble_gap_addr_t bleGapAddr = toPlatformAddress(newAddr);
    int ret = sd_ble_gap_addr_set(&bleGapAddr);
    return nrf_system_error(ret);
}

int BleObject::BleGap::getDeviceAddress(hal_ble_addr_t* address) const {
    CHECK_TRUE(address, SYSTEM_ERROR_INVALID_ARGUMENT);
    ble_gap_addr_t localAddr;
    int ret = sd_ble_gap_addr_get(&localAddr);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    *address = toHalAddress(localAddr);
    return SYSTEM_ERROR_NONE;
}

