particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
int BleObject::ConnectionsManager::setDesiredAttMtu(size_t attMtu) {
    desiredAttMtu_ = std::min(attMtu, (size_t)BLE_MAX_ATT_MTU_SIZE);
    return SYSTEM_ERROR_NONE;
}

/*
 * A device's Exchange MTU Request shall contain the same MTU as the
 * device's Exchange MTU Response (i.e. the MTU shall be symmetric).
 */
void BleObject::ConnectionsManager::onAttMtuExchangeTimerExpired(os_timer_t timer) {
    ConnectionsManager* connMgr;
    os_timer_get_id(timer, (void**)&connMgr);
    if (connMgr->attMtuExchanged(connMgr->attMtuExchangeConnHandle_)) {
        return;
    }
    LOG_DEBUG(TRACE, "Request to change ATT_MTU from %d to %d", BLE_DEFAULT_ATT_MTU_SIZE, connMgr->desiredAttMtu_);
    int ret = sd_ble_gattc_exchange_mtu_request(connMgr->attMtuExchangeConnHandle_, connMgr->desiredAttMtu_);
    if (ret != NRF_SUCCESS) {
        LOG_DEBUG(TRACE, "sd_ble_gattc_exchange_mtu_request() failed: %d", ret);
    }
}

void BleObject::ConnectionsManager::onConnParamsUpdateTimerExpired(os_timer_t timer) {
    ConnectionsManager* connMgr;
    os_timer_get_id(timer, (void**)&connMgr);
    if (connMgr->periphConnParamUpdateHandle_ == BLE_INVALID_CONN_HANDLE) {
        return;
    }
    // For Peripheral, it will use the PPCP characteristic value.
    int ret = sd_ble_gap_conn_param_update(connMgr->periphConnParamUpdateHandle_, nullptr);
    if (ret != NRF_SUCCESS) {
        connMgr->periphConnParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
        connMgr->connParamsUpdateAttempts_ = 0;
        sd_ble_gap_disconnect(connMgr->periphConnParamUpdateHandle_, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        LOG_DEBUG(TRACE, "Disconnecting. Update BLE connection parameters failed.");
        return;
    }
    connMgr->connParamsUpdateAttempts_++;
}

void BleObject::ConnectionsManager::notifyLinkEvent(const hal_ble_link_evt_t& event) {
    BleConnection* connection = fetchConnection(event.conn_handle);
    if (connection) {
        if (connection->info.role == BLE_ROLE_CENTRAL) {
            if (connection->handler.callback) {
                connection->handler.callback(&event, connection->handler.context);
            }
        } else {
            for (const auto& handler : peripheralLinkEventHandlers_) {
                if (handler.callback) {
                    handler.callback(&event, handler.context);
                }
            }
        }
    }
}

int BleObject::ConnectionsManager::processConnectedEventFromThread(const ble_evt_t* event) {
    const ble_gap_evt_connected_t& connected = event->evt.gap_evt.params.connected;
    BleConnection connection = {};
    connection.info.version = BLE_API_VERSION;
    connection.info.size = sizeof(hal_ble_conn_info_t);
    connection.info.role = (hal_ble_role_t)connected.role;
    connection.info.conn_handle = event->evt.gap_evt.conn_handle;
    connection.info.conn_params = toHalConnParams(&connected.conn_params);
    connection.info.address = toHalAddress(connected.peer_addr);
    connection.info.att_mtu = BLE_DEFAULT_ATT_MTU_SIZE; // Use the default ATT_MTU on connected.
    connection.isMtuExchanged = false;
    int ret = addConnection(connection);
    if (ret != SYSTEM_ERROR_NONE) {
        LOG(ERROR, "Add new connection failed. Disconnects from peer.");
        if (sd_ble_gap_disconnect(connection.info.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION) != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_gap_disconnect() failed.");
        }
        return ret;
    }
    LOG_DEBUG(TRACE, "BLE role: %d, connection handle: %d", connection.info.role, connection.info.conn_handle);
    LOG_DEBUG(TRACE, "| interval(ms)  latency  timeout(ms) |");
    LOG_DEBUG(TRACE, "  %d*1.25          %d       %d*10", connection.info.conn_params.max_conn_interval,
            connection.info.conn_params.slave_latency, connection.info.conn_params.conn_sup_timeout);
    if (connection.info.role == BLE_ROLE_PERIPHERAL) {
        // Update connection parameters if needed.
        connParamsUpdateAttempts_ = 0;
        initiateConnParamsUpdateIfNeeded(&connection);
        // Notify the connected event.
        hal_ble_link_evt_t linkEvent = {};
        linkEvent.type = BLE_EVT_CONNECTED;
        linkEvent.conn_handle = connection.info.conn_handle;
        linkEvent.params.connected.info = &connection.info;
        notifyLinkEvent(linkEvent);
    }
    if (desiredAttMtu_ > BLE_DEFAULT_ATT_MTU_SIZE) {
        // FIXME: What if there is another new connection established before the timer expired?
        if (!os_timer_change(attMtuExchangeTimer_, OS_TIMER_CHANGE_START, true, 0, 0, nullptr)) {
            LOG_DEBUG(TRACE, "Attempts to exchange ATT_MTU if needed.");
            attMtuExchangeConnHandle_ = event->evt.gap_evt.conn_handle;
        }
    }
    // If the connection is initiated by Central.
    if (isConnecting_ && connection.info.role == BLE_ROLE_CENTRAL && addressEqual(connection.info.address, connectingAddr_)) {
        isConnecting_ = false;
        os_semaphore_give(connectSemaphore_, false);
    }
    return SYSTEM_ERROR_NONE;
}

int BleObject::ConnectionsManager::processDisconnectedEventFromThread(const ble_evt_t* event) {
    const ble_gap_evt_disconnected_t& disconnected = event->evt.gap_evt.params.disconnected;
    BleConnection* connection = fetchConnection(event->evt.gap_evt.conn_handle);
    if (!connection) {
        LOG(ERROR, "Connection not found.");
        return SYSTEM_ERROR_NOT_FOUND;
    }
    // Cancel the on-going connection parameters update procedure.
    if (periphConnParamUpdateHandle_ == connection->info.conn_handle) {
        if (!os_timer_is_active(connParamsUpdateTimer_, nullptr)) {
            connParamsUpdateAttempts_ = 0;
            periphConnParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
            os_timer_change(connParamsUpdateTimer_, OS_TIMER_CHANGE_STOP, true, 0, 0, nullptr);
        } else {
            periphConnParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
            os_semaphore_give(connParamsUpdateSemaphore_, false);
        }
    }
    if (centralConnParamUpdateHandle_ == connection->info.conn_handle) {
        centralConnParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
        os_semaphore_give(connParamsUpdateSemaphore_, false);
    }
    // If the ATT MTU exchanging procedure is on-going.
    if (!os_timer_is_active(attMtuExchangeTimer_, nullptr)) {
        os_timer_change(attMtuExchangeTimer_, OS_TIMER_CHANGE_STOP, true, 0, 0, nullptr);
    }
    // Remove the GATTS subscriber.
    BleObject::getInstance().gatts()->removeSubscriberFromAllCharacteristics(connection->info.conn_handle);
    // Remove the publishers on this connection.
    BleObject::getInstance().gattc()->removeAllPublishersOfConnection(connection->info.conn_handle);
    // If the disconnection is initiated by application.
    if (disconnectingHandle_ == connection->info.conn_handle) {
        os_semaphore_give(disconnectSemaphore_, false);
    } else {
        // Notify the connected event.
        hal_ble_link_evt_t linkEvent = {};
        linkEvent.type = BLE_EVT_DISCONNECTED;
        linkEvent.conn_handle = connection->info.conn_handle;
        linkEvent.params.disconnected.reason = disconnected.reason;
        notifyLinkEvent(linkEvent);
    }
    removeConnection(connection->info.conn_handle);
    return SYSTEM_ERROR_NONE;
}

int BleObject::ConnectionsManager::processConnParamsUpdatedEventFromThread(const ble_evt_t* event) {
    const ble_gap_evt_conn_param_update_t& connParamsUpdate = event->evt.gap_evt.params.conn_param_update;
    BleConnection* connection = fetchConnection(event->evt.gap_evt.conn_handle);
    if (!connection) {
        LOG(ERROR, "Connection not found.");
        return SYSTEM_ERROR_NOT_FOUND;
    }
    connection->info.conn_params = toHalConnParams(&connParamsUpdate.conn_params);
    LOG_DEBUG(TRACE, "| interval(ms)  latency  timeout(ms) |");
    LOG_DEBUG(TRACE, "  %d*1.25          %d       %d*10", connection->info.conn_params.max_conn_interval,
            connection->info.conn_params.slave_latency, connection->info.conn_params.conn_sup_timeout);
    // Notify the connection parameters updated event.
    hal_ble_link_evt_t linkEvent = {};
    linkEvent.type = BLE_EVT_CONN_PARAMS_UPDATED;
    linkEvent.conn_handle = connection->info.conn_handle;
    linkEvent.params.conn_params_updated.conn_params = &connection->info.conn_params;
    notifyLinkEvent(linkEvent);
    if (periphConnParamUpdateHandle_ == connection->info.conn_handle) {
        if (connParamsUpdateAttempts_ != 0) {
            initiateConnParamsUpdateIfNeeded(connection);
        } else {
            periphConnParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
            os_semaphore_give(connParamsUpdateSemaphore_, false);
        }
    }
    if (centralConnParamUpdateHandle_ == connection->info.conn_handle) {
        centralConnParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
        os_semaphore_give(connParamsUpdateSemaphore_, false);
    }
    return SYSTEM_ERROR_NONE;
}

int BleObject::ConnectionsManager::processAttMtuExchangeEventFromThread(const ble_evt_t* event) {
    size_t effectAttMtu;
    if (event->header.evt_id == BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST) {
        const ble_gatts_evt_exchange_mtu_request_t& mtuRequest = event->evt.gatts_evt.params.exchange_mtu_request;
        effectAttMtu = std::min((size_t)mtuRequest.client_rx_mtu, desiredAttMtu_);
    } else if (event->header.evt_id == BLE_GATTC_EVT_EXCHANGE_MTU_RSP) {
        const ble_gattc_evt_exchange_mtu_rsp_t& attMtuRsp = event->evt.gattc_evt.params.exchange_mtu_rsp;
        effectAttMtu = std::min((size_t)attMtuRsp.server_rx_mtu, desiredAttMtu_);
    } else {
        return SYSTEM_ERROR_INTERNAL;
    }
    effectAttMtu = std::max(effectAttMtu, (size_t)BLE_MIN_ATT_MTU_SIZE);
    LOG_DEBUG(TRACE, "Effective ATT MTU: %d.", effectAttMtu);
    configureAttMtu(event->evt.gatts_evt.conn_handle, effectAttMtu);
    // Notify the ATT MTU updated event.
    hal_ble_link_evt_t linkEvent = {};
    linkEvent.type = BLE_EVT_ATT_MTU_UPDATED;
    linkEvent.conn_handle = event->evt.gatts_evt.conn_handle;
    linkEvent.params.att_mtu_updated.att_mtu_size = effectAttMtu;
    notifyLinkEvent(linkEvent);
    return SYSTEM_ERROR_NONE;
}

